hello-yan3/STM32-learning/14-PWR—电源管理/1.2PWR—停止模式/User/main.c
/**
  ******************************************************************************
  * @file    main.c
  * @author  fire
  * @version V1.0
  * @date    2013-xx-xx
  * @brief   测试led
  ******************************************************************************
  * @attention
  *
  * 实验平台:野火 F103-霸道 STM32 开发板 
  * 论坛    :http://www.firebbs.cn
  * 淘宝    :https://fire-stm32.taobao.com
  *
  ******************************************************************************
  */ 

/* Includes ------------------------------------------------------------------*/
#include "main.h"
#include "stm32f1xx.h"
#include "./led/bsp_led.h"
#include "./usart/bsp_debug_usart.h"
#include "./key/bsp_exti.h"

static void SYSCLKConfig_STOP(void);

/**
  * @brief  主函数
  * @param  无
  * @retval 无
  */
int main(void) 
{
	uint32_t SYSCLK_Frequency[2] ={0}; 
	uint32_t HCLK_Frequency[2]   ={0};
	uint32_t PCLK1_Frequency[2]  ={0};
	uint32_t PCLK2_Frequency[2]  ={0};
	uint32_t SYSCLK_Source[2]    ={0};
	
	HAL_Init();
	/* 初始化系统时钟为72MHz */
	SystemClock_Config();
	/* 初始化LED */
	LED_GPIO_Config();	
	/* 初始化调试串口，一般为串口1 */
	DEBUG_USART_Config();	
	/* 初始化按键为中断模式，按下中断后会进入中断服务函数	*/
	EXTI_Key_Config(); 
	
	printf("\r\n 欢迎使用野火  STM32 F103 开发板。\r\n");
  printf("野火F103 停止模式例程\r\n");
	
	printf("\r\n 实验说明：\r\n");

	printf("1.本程序中，绿灯表示STM32正常运行，红灯表示睡眠状态，蓝灯表示刚从停止状态被唤醒\r\n");
	printf("2.程序运行一段时间后自动进入停止状态，在停止状态下，可使用KEY1或KEY2唤醒\r\n");
	printf("3.本实验执行这样一个循环：\r\n ------》亮绿灯(正常运行)->亮红灯(停止模式)->按KEY1或KEY2唤醒->亮蓝灯(刚被唤醒)-----》\r\n");
	printf("4.在停止状态下，DAP下载器无法给STM32下载程序，\r\n 可按KEY1、KEY2唤醒后下载，\r\n 或按复位键使芯片处于复位状态，然后在电脑上点击下载按钮，再释放复位按键，即可下载\r\n");

	while(1)
	{	
		/*********执行任务***************************/
		printf("\r\n ————————————————\r\n");
		printf("\r\n STM32正常运行，亮绿灯\r\n");

		LED_GREEN;	
		HAL_Delay(2000);		
		/*****任务执行完毕，进入睡眠降低功耗***********/

		printf("\r\n 进入停止模式，亮红灯,按KEY1或KEY2按键可唤醒\r\n");

		//使用红灯指示，进入睡眠状态
		LED_RED;
		//暂停滴答时钟，防止通过滴答时钟中断唤醒
		HAL_SuspendTick();
		
		/* 进入停止模式，设置电压调节器为低功耗模式，等待中断唤醒 */
		// PWR_MAINREGULATOR_ON表示调节器在主模式，PWR_LOWPOWERREGULATOR_ON表示调节器在低功耗模式，低功耗模式唤醒时间更长
		// PWR_SLEEPENTRY_WFI 表示通过WFI(中断)指令进入睡眠模式，PWR_SLEEPENTRY_WFE 表示通过WFE(事件)指令进入睡眠模式
		// 之后使用任意外部中断可从睡眠模式中唤醒
		HAL_PWR_EnterSTOPMode(PWR_LOWPOWERREGULATOR_ON, PWR_STOPENTRY_WFI);
		
		//等待中断唤醒  K1或K2按键中断	
		/***被唤醒，亮蓝灯指示***/
		LED_BLUE;
		
		//根据时钟寄存器的值更新SystemCoreClock变量
		SystemCoreClockUpdate();
		//获取唤醒后的时钟状态	
		SYSCLK_Frequency[0] = HAL_RCC_GetSysClockFreq(); 
		HCLK_Frequency[0]   = HAL_RCC_GetHCLKFreq();
		PCLK1_Frequency[0]  = HAL_RCC_GetPCLK1Freq();
		PCLK2_Frequency[0]  = HAL_RCC_GetPCLK2Freq();
		SYSCLK_Source[0]    = __HAL_RCC_GET_SYSCLK_SOURCE();
		
		// 注意这里由于串口直接使用HSI时钟，串口输出会出错

		/* 从停止模式唤醒后配置系统时钟:启用HSE、PLL*/
		/* 选择PLL作为系统时钟源(HSE和PLL在停止模式下被禁用)*/
		SYSCLKConfig_STOP();
		
		//被唤醒后，恢复滴答时钟			
		HAL_ResumeTick();
		//获取重新配置后的时钟状态
		SYSCLK_Frequency[1] = HAL_RCC_GetSysClockFreq(); 
		HCLK_Frequency[1]   = HAL_RCC_GetHCLKFreq();
		PCLK1_Frequency[1]  = HAL_RCC_GetPCLK1Freq();
		PCLK2_Frequency[1]  = HAL_RCC_GetPCLK2Freq();
		SYSCLK_Source[1]    = __HAL_RCC_GET_SYSCLK_SOURCE();
		
		//系统刚唤醒后的时钟频率
		printf("\r\n刚唤醒的时钟状态：\r\n");
		printf(" SYSCLK频率:%d,\r\n HCLK频率:%d,\r\n PCLK1频率:%d,\r\n PCLK2频率:%d,\r\n 时钟源:%d (0表示HSI，8表示PLLCLK)\n", 
		SYSCLK_Frequency[0],HCLK_Frequency[0],PCLK1_Frequency[0],PCLK2_Frequency[0],SYSCLK_Source[0]);		  
		
		//重新配置时钟源后始终状态
		printf("\r\n重新配置后的时钟状态：\r\n");
		printf(" SYSCLK频率:%d,\r\n HCLK频率:%d,\r\n PCLK1频率:%d,\r\n PCLK2频率:%d,\r\n 时钟源:%d (0表示HSI，8表示PLLCLK)\n", 
		SYSCLK_Frequency[1],HCLK_Frequency[1],PCLK1_Frequency[1],PCLK2_Frequency[1],SYSCLK_Source[1]);

		HAL_Delay(2000);	
			
		printf("\r\n 已退出停止模式\r\n");
		//继续执行while循环
		printf("\r\n ————————————————\r\n");
	}
}

/**
  * @brief  从停止模式唤醒后配置系统时钟:启用HSE、PLL并选择PLL作为系统时钟源。
  * @param  无
  * @retval 无
  */
static void SYSCLKConfig_STOP(void)
{
	RCC_ClkInitTypeDef RCC_ClkInitStruct = {0};
	RCC_OscInitTypeDef RCC_OscInitStruct = {0};
	uint32_t pFLatency = 0;

	/* 启用电源控制时钟 */
	__HAL_RCC_PWR_CLK_ENABLE();

	/* 根据内部RCC寄存器获取振荡器配置 */
	HAL_RCC_GetOscConfig(&RCC_OscInitStruct);

	/* 从停止模式唤醒后重新配置系统时钟: 启用HSE和PLL */
	RCC_OscInitStruct.OscillatorType  = RCC_OSCILLATORTYPE_HSE;
	RCC_OscInitStruct.HSEState        = RCC_HSE_ON;
	RCC_OscInitStruct.PLL.PLLState    = RCC_PLL_ON;
	if (HAL_RCC_OscConfig(&RCC_OscInitStruct) != HAL_OK)
	{
	while(1) { ; }
	}

	/* 根据内部RCC寄存器获取时钟配置 */
	HAL_RCC_GetClockConfig(&RCC_ClkInitStruct, &pFLatency);

	/* 选择 PLL 作为系统时钟源, 并配置 HCLK、PCLK1 和 PCLK2时钟分频系数 */
	RCC_ClkInitStruct.ClockType     = RCC_CLOCKTYPE_SYSCLK;
	RCC_ClkInitStruct.SYSCLKSource  = RCC_SYSCLKSOURCE_PLLCLK;
	if (HAL_RCC_ClockConfig(&RCC_ClkInitStruct, pFLatency) != HAL_OK)
	{
	while(1) { ; }
	}
}




/**
  * @brief  System Clock Configuration
  *         The system Clock is configured as follow : 
  *            System Clock source            = PLL (HSE)
  *            SYSCLK(Hz)                     = 72000000
  *            HCLK(Hz)                       = 72000000
  *            AHB Prescaler                  = 1
  *            APB1 Prescaler                 = 2
  *            APB2 Prescaler                 = 1
  *            HSE Frequency(Hz)              = 8000000
  *            HSE PREDIV1                    = 2
  *            PLLMUL                         = 9
  *            Flash Latency(WS)              = 0
  * @param  None
  * @retval None
  */
void SystemClock_Config(void)
{
  RCC_ClkInitTypeDef clkinitstruct = {0};
  RCC_OscInitTypeDef oscinitstruct = {0};
  
  /* Enable HSE Oscillator and activate PLL with HSE as source */
  oscinitstruct.OscillatorType  = RCC_OSCILLATORTYPE_HSE;
  oscinitstruct.HSEState        = RCC_HSE_ON;
  oscinitstruct.HSEPredivValue  = RCC_HSE_PREDIV_DIV1;
  oscinitstruct.PLL.PLLState    = RCC_PLL_ON;
  oscinitstruct.PLL.PLLSource   = RCC_PLLSOURCE_HSE;
  oscinitstruct.PLL.PLLMUL      = RCC_PLL_MUL9;
  if (HAL_RCC_OscConfig(&oscinitstruct)!= HAL_OK)
  {
    /* Initialization Error */
    while(1); 
  }

  /* Select PLL as system clock source and configure the HCLK, PCLK1 and PCLK2 
     clocks dividers */
  clkinitstruct.ClockType = (RCC_CLOCKTYPE_SYSCLK | RCC_CLOCKTYPE_HCLK | RCC_CLOCKTYPE_PCLK1 | RCC_CLOCKTYPE_PCLK2);
  clkinitstruct.SYSCLKSource = RCC_SYSCLKSOURCE_PLLCLK;
  clkinitstruct.AHBCLKDivider = RCC_SYSCLK_DIV1;
  clkinitstruct.APB2CLKDivider = RCC_HCLK_DIV1;
  clkinitstruct.APB1CLKDivider = RCC_HCLK_DIV2;  
  if (HAL_RCC_ClockConfig(&clkinitstruct, FLASH_LATENCY_2)!= HAL_OK)
  {
    /* Initialization Error */
    while(1); 
  }
}

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
